"use strict";

//--------------------------------- for --------------------------------

const str = "Hello";

// for (let i = 0; i < str.length; i++) {  // перебирає з початку до кінця
// console.log(str[i]);
// }

// for (let i = str.length - 1; i >= 0; i--) { // перебирає зкінця до початку
// console.log(str[i]);
// }

// for (let i = 0; i < str.length; i++) {
//     if (str[i] === "l") {
//         break;
//      }                                        // припинити перебір на символі "l"
// console.log(str[i]);
// }

//--------------------------------- while --------------------------------

// let counter = 0;

// while (counter < 5) {
//     console.log(counter);
//     counter += 1;
// }

//--------------------------------- do while --------------------------------

// let counter = 5;

// do {
//     console.log(counter);
//     counter += 1;
// } while (counter < 5);

//---------------------------------------------------------------------------


/**
 * Напиши цикл for, який виводить у консоль браузера
 * числа за зростанням від a до b, але тільки якщо число кратне 5.
 */

// const a = 20;
// const b = 100;

// for (let i = a; i < b; i++) {
//     if (!(i % 5)) {
//         console.log(i);
//     }
// }

//---------------------------------------------------------------------------

/*
 * Напиши скрипт, який підраховує суму всіх парних чисел,
 * які входять в діапазон чисел у змінних від min до max.
 * Наприклад, якщо min=0 и max=5, то діапазон 0-5, і в 
 * ньому два парних числа - 2 і 4, їх сума 6.
 */

// const min = 0;
// const max = 5;
// let total = 0;

// for (let i = min; i < max; i++) {
//     if (!(i % 2)) {      // з такою умовою
//         total += i;                     // проводиться додавання в блоці if
//     }
// }

// console.log(total);


// const min = 0;
// const max = 5;
// let total = 0;

// for (let i = min; i <= max; i++) {
//     if (i % 2 !== 0) {      // з такою умовою       
//         continue;      // дає змогу додавати в тілі циклу
//     }
//     total += i;                              // // проводиться додавання в тілі циклу for
// }

// console.log(total);

//---------------------------------------------------------------------------


